#Задача 7
#На всеки от върховете на равностранен триъгълник има една мравка. 
#Всяка мравка избира произволно един от другите два върха и тръгва 
#към него. За единица време всяка мравка изминава разстоянието от 
#един връх до друг. Две мравки могат да се разминат, ако тръгнат 
#една срещу друга. Каква е вероятността след единица време да има 
#по една мравка на всеки връх?

sim.ants <-function() {
ant1<- sample(c(2,3), 1)
ant2<- sample(c(1,3), 1)
ant3<- sample(c(1,2), 1)
a<- c(ant1, ant2, ant3)
a
#unique с аргумент вектор премахва повтарящи се елементи
length(unique(a)) == 3
}

prob.ants <- function(){
res <- replicate(100000, sim.ants())
sum(res) / length(res)
}

prob.ants()

# Задача 8:
# В кутия има 6 сурови и 2 сварени яйца. Двама играчи, редувайки се, 
# избират яйце докато извадят всички яйца. Намерете вероятностите на 
# следните събития:
#  𝐴 = {на един играч се падат двете сварени яйца};
#  𝐵 = {пада се по едно сварено яйце на всеки играч};
#  𝐶 = {падат се двете сварени яйца на този, който тегли първи};
#  𝐷 = {падат се двете сварени яйца на този, който тегли втори}

sim.eggs <- function() {
  eggs  <- c(rep('r', 6), rep('b', 2))
  draws <- sample(eggs, 8, replace = FALSE)
  #слагаме вектор от индекси
  player1 <- draws[c(1, 3, 5, 7)]
  player2 <- draws[c(2, 4, 6, 8)] 
  b1 <- sum(player1 == 'b')
  b2 <- sum(player2 == 'b')
  c(b1, b2)
}

sim.eggs()
res<-replicate(1000, sim.eggs())
# показва вектора от двойки под формата на матрица
View(res)

# дава ни първата колона
res[, 1]
# дава ни първия ред от матрицата
res[1, ]

# P(A)
(sum( res[1, ] == 2 ) + sum( res[2, ] == 2 )) / 1000

# P(B)
# Щом на първия ред има 1, то и на втория има 1
sum( res[1, ] == 1 ) / 1000

# P(C)
sum( res[1, ] == 2 ) / 1000

# P(D)
sum( res[2, ] == 2 ) / 1000

# Задача 9:
# На студенти е даден тест от 10 въпроса, всеки с по 4 възможни отговора, 
# един от които е верен. Иван се явява на теста без да е учил и огражда 
# произволно отговори. Каква е вероятността да е отговорил вярно на поне 
# 5 от въпросите?

# 0-лата е с вероятност 75%, а 1 с вероятност 25%
# 0 = грешен отговор, 1 = верен отговор
questions <- sample( c(0, 0, 0, 1), 10, replace = TRUE)
#table(questions)

table(questions)

sim.test.ans <- function(){
  q  <- sample( c(0, 1), 10, replace = TRUE, prob = c(0.75, 0.25))
  sum(q)
}

prob.test.ans <- function(){
  res <- replicate(10000, sim.test.ans())
  sum(res == 5) / length(res)
}

prob.test.ans()

# Задача 10:
# Авиокомпания е продала 143 билета за самолет, в който има 138 пътнически
# места. Вероятността пътник да дойде навреме за полета си е 0.92. Нека
# приемем, че даден пътник идва навреме независимо от останалите пътниците.
#  а) Каква е вероятността да има място за всички пътници, които са 
#     дошли навреме?
#  б) Каква е вероятността да остане едно незаето пътническо място?

sim.airplane <- function(){
  x <- sample(c(0, 1), 143, replace = T, prob = c(0.08, 0.92) )
  sum(x)
}

res <- replicate(100000, sim.airplane())
# a)
sum( res <= 138) / length(res)
# б) 
sum( res == 137) /length(res)

# Задача 11: 
# В една кутия има 2 зелени и 2 червени топки. В друга кутия има 1 зелена
# и 4 червени топки. Хвърляме зар и ако се падне шестица, теглим топка от
# първата кутия, а ако не се падне шестица, теглим топка от втората кутия.
#   а) Каква е вероятността да извадим зелена топка?
#   б) Ако извадената топка е зелена, каква е вероятността да е извадена 
#      от втората кутия?

sim.dice.ball <- function() {
  dice <- sample(c(1:6), 1)
  if(dice == 6){
    ball <- sample(c('g','g', 'r', 'r'), 1)
  } else {
    ball <- sample(c('g', 'r', 'r', 'r', 'r'), 1)
  }
  c(dice, ball)
}

res <- replicate(10000, sim.dice.ball())
sum( res[1, ] != "6" & res[2, ] == "g") / sum(res[2, ] == "g")

# Задача 12: 
# Разглеждаме три типа монети: тип 𝑇11 имат изписана единица от двете 
# страни, тип 𝑇22 имат двойка от двете страни и тип 𝑇12 имат единица 
# от едната страна и двойка от другата. 
# В кутия има две монети 𝑇11, една монета 𝑇22 и две монети 𝑇12. 
# Теглим произволна монета и я хвърляме.
#  а) Каква е вероятността да се падне единица?
#  б) Ако горната страна на хвърлената монета е единица, каква е 
#     вероятността другата страна да е двойка?
sim.coins.b <- function() {
  coin <- sample(c(11, 11, 22, 12, 12), 1)
  side <- sample(c(1, 2), 1)
  up <- substr(coin, start = side, stop = side)
  c(up, coin)
}
Nrep <- 10000
res <- replicate(Nrep, sim.coins.b())
sum(res[1, ] == "1") / Nrep
sum(res[1,] == "1" & res[2, ] == "12") / sum(res[1, ] == "1")
  