# можем да извършваме аритметични операции
1+2
sqrt(49)

# присвояване се извършва със знака "<-" или "="
# на упражнения ще използваме "<-" предимно
x <- 5
x

# можем да дефинираме вектор с "c()"
# в х генерираме всички числа от 1 до 4 
x <- c(1:4)
x

# много често ще използваме функцията sample 
# sample(<вектор>; <размер>; replace = TRUE/FALSE)
# функцията sample ще генерира вариация на 
# числата във вектора от първи аргумент, като 
# дължината на вариацията е втория аргумент;
# третият аргумент отговаря за това дали 
# вариацията е с повторение
perm <- sample(x, 3, replace = FALSE)
perm

# задача 1: В кутия има 8 топки, номерирани от 1 до 8. 
# Вадим произволна топка и я връщаме в кутията. Отново 
# вадим произволна топка. Каква е вероятността да извадим
# два пъти една и съща топка?

# дефинираме функция чрез "function()",ако има нужда от 
# аргументи, ги поставяме в скобите; функцията връща 
# резултата от последния ред в тялото
sim.sameBall <- function(){
  ball1 <- sample(c(1:8), 1, replace = FALSE)
  ball2 <- sample(c(1:8), 1, replace = FALSE)
  ball1 == ball2
}

# функцията replicate(<число>;<функция>) изпълнява
# подадената като втори агрумент функция n на брой 
# пъти като n е числото, което е подадено като първи
# аргумент на replicate
x <- replicate(10000, sim.sameBall())

# функцията sum(<вектор>) сумира числата във вектора,
# подаден като аргумент
# в res запазваме вероятността
res <- sum(x) / length(x)
res

# В кутия има 3 различни чифта чорапи. Вадим в тъмното 
# 2 чорапа. Каква е вероятността извадените два чорапа 
#да са чифт?

sim.socks <- function(){
  #номерираме чифтовете чорапи
  s <- sample(c(1, 1, 2, 2 ,3, 3), 2, replace = FALSE)
  s[1] == s[2]
}

prob.socks <- function(len){
  x <- replicate(len, sim.socks())
  res<- sum(x) /len
  res
}

prob.socks(100000)

# задача 3:Иван има 4 ключа, но не знае кой е за неговата
# стая. Предполагаме, че ключовете са разбъркани по произволен 
# начин. Иван пробва последователно с всеки от тях, като помни
# кой ключ е пробвал. Каква е вероятността да отключи с 
#последния ключ?

sim.keys <- function(){
  keys <- sample(c(1:4), 4, replace = FALSE)
  #предполагаме, че правилният ключ е 1
  keys[4] == 1
}

prob.keys <- function(len){
  x <- replicate(len, sim.keys())
  sum(x) / len
}

prob.keys(10000)

# Задача 4: Студент се явява на изпит с конспект от 20 въпроса.
# От тях не знае само 3 въпроса. На изпита си тегли 2 въпроса от
#конспекта. Каква е вероятността да знае само един от изтеглените 
#въпроси?

sim.exam <- function(){
  #rep() от repeat 
  #rep(<число>, <повторения>)
  themes <- sample(c(rep(1, 17), rep(0, 3)), 2, replace = FALSE)
  themes[1] != themes[2]
}

prob.exam <- function(len){
  res <- replicate(len, sim.exam())
  sum(res) / len
}

prob.exam(100000)

# задача 5: Каква е вероятността в група от 25 човека поне двама 
# да имат рожден ден на един и същи ден от годината?

sim.birthday <- function(people){
  date <- sample(c(1 : 365), people, replace = TRUE)
  anyDuplicated(date) > 0
}

prob.birthday <- function(people, len){
  x <- replicate(len, sim.birthday(people))
  sum(x) / len   
}

prob.birthday(25, 100000)

# задача 6: В отдел на фирма работят 20 човека. За Коледа
# те решават да си разменят подаръци. В кутия слагат 20 
# листчета, на всяко от които има едно име. Всеки тегли листче
# (без да го връща) и подарява на този, чието име е изтеглил. 
# Каква е вероятността поне един да изтегли своето име?

sim.gifts <- function(){
  gifts  <- sample(c(1:20), 20, replace = FALSE)
  people <- gifts - c(1:20)
  any(people == 0)
}  

prob.gifts <- function(len){
  x <- replicate(len, sim.gifts())
  sum(x) / len   
}

prob.gifts(100000)

# Забележка: Употребата на функциите, които съм използвала и описала,
# не е единствена !!